HUDK 4051

Yiran Wang

2022/02/09

# ICE 1 Database Manipulation

# Introduction to SQL

SQL, which stands for Structured Query Language, is a language for interacting with data stored in something called a relational database.

## Chapter 1: Selecting Columns

### SELECTing single columns

In SQL, you can select data from a table using a SELECT statement. 
In this query, SELECT and FROM are called keywords.

ex:
SELECT name 
FROM people;

### SELECTing multiple columns

ex:
SELECT name, birthdate
FROM people;

##### Selecting all columns:

SELECT *
FROM people;

##### If you only want to return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned:

SELECT *
FROM people
LIMIT 10;

### SELECT DISTINCT

Often your results will include many duplicate values. If you want to select all the unique values from a column, you can use the DISTINCT keyword.

ex:
SELECT DISTINCT language
FROM films;

### Learning to COUNT

What if you want to count the number of employees in your employees table? The COUNT() function lets you do this by returning the number of rows in one or more columns.

ex:
SELECT COUNT(*)
FROM people;

### Learning to COUNT

What if you want to count the number of employees in your employees table? The COUNT() function lets you do this by returning the number of rows in one or more columns.

ex:
SELECT COUNT(*)
FROM people;

As you've seen, COUNT(*) tells you how many rows are in a table. However, if you want to count the number of non-missing values in a particular column, you can call COUNT() on just that column.

ex:
SELECT COUNT(birthdate)
FROM people;

It's also common to combine COUNT() with DISTINCT to count the number of distinct values in a column.

ex:
SELECT COUNT(DISTINCT birthdate)
FROM people;

## Chapter 2: Filtering Rows

### Filtering results

In SQL, the WHERE keyword allows you to filter based on both text and numeric values in a table. There are a few different comparison operators you can use:

- = equal
- <> not equal
- < less than
- > greater than
- <= less than or equal to
- >= greater than or equal to

ex:
SELECT title
FROM films
WHERE title = 'Metropolis';

Notice that the WHERE clause always comes after the FROM statement!

### Simple filtering of numeric values

As you learned in the previous exercise, the WHERE clause can also be used to filter numeric records, such as years or ages.

ex:
SELECT *
FROM films
WHERE budget > 10000;

### Simple filtering of text

Remember, the WHERE clause can also be used to filter text results, such as names or countries.

ex:
SELECT title
FROM films
WHERE country = 'China';

### WHERE AND

Often, you'll want to select data based on multiple conditions. You can build up your WHERE queries by combining multiple conditions with the AND keyword.

ex:
SELECT title
FROM films
WHERE release_year > 1994
AND release_year < 2000;

Note that you need to specify the column name separately for every AND condition,so the following would be invalid:

ex:
SELECT title
FROM films
WHERE release_year > 1994 AND < 2000;

You can add as many AND conditions as you need!

### WHERE AND OR

What if you want to select rows based on multiple conditions where some but not all of the conditions need to be met? For this, SQL has the OR operator.

For example, the following returns all films released in either 1994 or 2000:

ex:

SELECT title
FROM films
WHERE release_year = 1994
OR release_year = 2000;

When combining AND and OR, be sure to enclose the individual clauses in parentheses, like so:

ex:
SELECT title
FROM films
WHERE (release_year = 1994 OR release_year = 1995)
AND (certification = 'PG' OR certification = 'R');

### BETWEEN

Checking for ranges like this is very common, so in SQL the BETWEEN keyword provides a useful shorthand for filtering values within a specified range.

For example, get titles of all films released in and between 1994 and 2000:

ex:

SELECT title
FROM films
WHERE release_year
BETWEEN 1994 AND 2000;

It's important to remember that BETWEEN is inclusive, meaning the beginning and end values are included in the results!

### WHERE IN

As you've seen, WHERE is very useful for filtering results. However, if you want to filter based on many conditions, WHERE can get unwieldy.

Enter the IN operator! The IN operator allows you to specify multiple values in a WHERE clause, making it easier and quicker to specify multiple OR conditions! Neat, right?

ex:

SELECT name
FROM kids
WHERE age IN (2, 4, 6, 8, 10);

### Introduction to NULL and IS NULL

In SQL, NULL represents a missing or unknown value. You can check for NULL values using the expression IS NULL.

For example, to count the number of missing birth dates in the people table:

ex:

SELECT COUNT(*)
FROM people
WHERE birthdate IS NULL;

As you can see, IS NULL is useful when combined with WHERE to figure out what data you're missing.

Sometimes, you'll want to filter out missing values so you only get results which are not NULL. To do this, you can use the IS NOT NULL operator.

For example, this query gives the names of all people whose birth dates are not missing in the people table.

ex:

SELECT name
FROM people
WHERE birthdate IS NOT NULL;

### LIKE and NOT LIKE

As you've seen, the WHERE clause can be used to filter text data. However, so far you've only been able to filter by specifying the exact text you're interested in. In the real world, often you'll want to search for a pattern rather than a specific text string.

In SQL, the LIKE operator can be used in a WHERE clause to search for a pattern in a column. To accomplish this, you use something called a wildcard as a placeholder for some other values. There are two wildcards you can use with LIKE:


The % wildcard will match zero, one, or many characters in text.

For example, the following query matches companies like 'Data', 'DataC' 'DataCamp', 'DataMind', and so on:

ex:

SELECT name
FROM companies
WHERE name LIKE 'Data%';


The _ wildcard will match a single character.

For example, the following query matches companies like 'DataCamp', 'DataComp', and so on:

ex:

SELECT name
FROM companies
WHERE name LIKE 'DataC_mp';

You can also use the NOT LIKE operator to find records that don't match the pattern you specify.

## Chapter 3: Aggregate Functions

### Aggregate functions

Often, you will want to perform some calculation on the data in a database. SQL provides a few functions, called aggregate functions, to help you out with this.

ex:

SELECT AVG(budget)
FROM films;

gives you the average value from the budget column of the films table.


Similarly, the MAX() function returns the highest budget:

ex:

SELECT MAX(budget)
FROM films;


The SUM() function returns the result of adding up the numeric values in a column:

ex:

SELECT SUM(budget)
FROM films;

You can probably guess what the MIN() function does!

### Combining aggregate functions with WHERE

Aggregate functions can be combined with the WHERE clause to gain further insights from your data.

For example, to get the total budget of movies made in the year 2010 or later:

ex:

SELECT SUM(budget)
FROM films
WHERE release_year >= 2010;

### A note on arithmetic

In addition to using aggregate functions, you can perform basic arithmetic with symbols like +, -, *, and /.


So, for example, this gives a result of 12:

ex:

SELECT (4 * 3);


However, the following gives a result of 1:

ex:

SELECT (4 / 3);


SQL assumes that if you divide an integer by an integer, you want to get an integer back. So be careful when dividing!

If you want more precision when dividing, you can add decimal places to your numbers.

ex:

SELECT (4.0 / 3.0) AS result;
gives you the result you would expect: 1.333.

### It's AS simple AS aliasing

You may have noticed in the first exercise of this chapter that the column name of your result was just the name of the function you used.

ex:

SELECT MAX(budget)
FROM films;

gives you a result with one column, named max. But what if you use two functions like this?

ex:

SELECT MAX(budget), MAX(duration)
FROM films;

Well, then you'd have two columns named max, which isn't very useful!


To avoid situations like this, SQL allows you to do something called aliasing. Aliasing simply means you assign a temporary name to something. To alias, you use the AS keyword, which you've already seen earlier in this course.

For example, in the above example we could use aliases to make the result clearer:

ex:

SELECT MAX(budget) AS max_budget,
       MAX(duration) AS max_duration
FROM films;

Aliases are helpful for making results more readable!

### Even more aliasing

Recall: SQL assumes that if you divide an integer by an integer, you want to get an integer back.

This means that the following will erroneously result in 400.0:

ex:

SELECT 45 / 10 * 100.0;

This is because 45 / 10 evaluates to an integer (4), and not a decimal number like we would expect.

So when you're dividing make sure at least one of your numbers has a decimal place:

ex:

SELECT 45 * 100.0 / 10;

The above now gives the correct answer of 450.0 since the numerator (45 * 100.0) of the division is now a decimal!

## Chapter 4: Sorting and grouping

### Order By

In SQL, the ORDER BY keyword is used to sort results in ascending or descending order according to the values of one or more columns.

By default ORDER BY will sort in ascending order. If you want to sort the results in descending order, you can use the DESC keyword.

ex:

SELECT title
FROM films
ORDER BY release_year DESC;

gives you the titles of films sorted by release year, from newest to oldest.

### Sorting single columns (DESC)

To order results in descending order, you can put the keyword DESC after your ORDER BY.

For example, to get all the names in the people table, in reverse alphabetical order:

ex:

SELECT name
FROM people
ORDER BY name DESC;

### Sorting multiple columns

ORDER BY can also be used to sort on multiple columns. It will sort by the first column specified, then sort by the next, then the next, and so on.

ex：

SELECT birthdate, name
FROM people
ORDER BY birthdate, name;

sorts on birth dates first (oldest to newest) and then sorts on the names in alphabetical order. The order of columns is important!

Try using ORDER BY to sort multiple columns! Remember, to specify multiple columns you separate the column names with a comma.

### GROUP BY

Now you know how to sort results! Often you'll need to aggregate results.

For example, you might want to count the number of male and female employees in your company. Here, what you want is to group all the males together and count them, and group all the females together and count them. In SQL, GROUP BY allows you to group a result by one or more columns, like so:

ex:

SELECT sex, count(*)
FROM employees
GROUP BY sex;

Commonly, GROUP BY is used with aggregate functions like COUNT() or MAX(). Note that GROUP BY always goes after the FROM clause!

A word of warning: SQL will return an error if you try to SELECT a field that is not in your GROUP BY clause without using it to calculate some kind of value about the entire group.

Note that you can combine GROUP BY with ORDER BY to group your results, calculate something about them, and then order your results.

ex:

SELECT sex, count(*)
FROM employees
GROUP BY sex
ORDER BY count DESC;

Note also that ORDER BY always goes after GROUP BY.

### HAVING a great time

In SQL, aggregate functions can't be used in WHERE clauses.

For example, the following query is invalid:

ex:

SELECT release_year
FROM films
GROUP BY release_year
WHERE COUNT(title) > 10;

This means that if you want to filter based on the result of an aggregate function, you need another way! That's where the HAVING clause comes in.

ex:

SELECT release_year
FROM films
GROUP BY release_year
HAVING COUNT(title) > 10;

shows only those years in which more than 10 films were released.

### A taste of things to come

There's one more concept we're going to introduce. You may have noticed that all your results so far have been from just one table, e.g., films or people.

In the real world however, you will often want to query multiple tables. For example, what if you want to see the IMDB score for a particular movie?

In this case, you'd want to get the ID of the movie from the films table and then use it to get IMDB information from the reviews table. In SQL, this concept is known as a join, and a basic join is shown in the editor to the right.

The query in the editor gets the IMDB score for the film To Kill a Mockingbird!

ex:

SELECT title, imdb_score
FROM films
JOIN reviews
ON films.id = reviews.film_id
WHERE title = 'To Kill a Mockingbird';

As you can see, joins are incredibly useful and important to understand for anyone using SQL.

We have a whole follow-up course dedicated to them called Joining Data in SQL for you to hone your database skills further!